app/views/home/index.html.erb

SELECT "claimeds".* FROM "claimeds" WHERE "claimeds"."user_id" = ?  [["user_id", 8]]
---

        <%if user_signed_in? && current_user.claimeds.blank?%>