app/controllers/claimeds_controller.rb

  def index
    @claimeds = Claimed.all
---
SELECT "claimeds".* FROM "claimeds"

  def create
    if params[:claim_house].present?
      if user_signed_in?
        if current_user.claimeds.count == 0
          flag_claimed = false
          Claimed.all.each do |claimed|
            if claimed.latitude == params[:latitude].to_f &&  claimed.longitude == params[:longitude].to_f
              flag_claimed = true
              break
            end
          end
          if flag_claimed == true
            arr = [1, "This house claimed !"]
            return render :text => arr.to_json
          else
            claim = Claimed.create(
              :user_id => current_user.id,
              :latitude => params[:latitude].to_f,
              :longitude => params[:longitude].to_f
            )
            arr = [0, "Created successfully !"]
            return render :text => arr.to_json
          end
        else
          arr = [2, "You registered house, can't claim more !"]
          return render :text => arr.to_json
        end
      end
    elsif params[:find_neighbors].present?
      items = []
      claim = current_user.claimeds.first
---
SELECT COUNT(*) FROM "claimeds" WHERE "claimeds"."user_id" = ?  [["user_id", 1]]
SELECT claimeds.*, (111.19492664455873 * ABS(claimeds.latitude - 40.676508) * 0.7071067811865475) + (96.29763124613503 * ABS(claimeds.longitude - -73.94748190000001) * 0.7071067811865475) AS distance, CASE WHEN (claimeds.latitude >= 40.676508 AND claimeds.longitude >= -73.94748190000001) THEN  45.0 WHEN (claimeds.latitude <  40.676508 AND claimeds.longitude >= -73.94748190000001) THEN 135.0 WHEN (claimeds.latitude <  40.676508 AND claimeds.longitude <  -73.94748190000001) THEN 225.0 WHEN (claimeds.latitude >= 40.676508 AND claimeds.longitude <  -73.94748190000001) THEN 315.0 END AS bearing FROM "claimeds" WHERE (claimeds.latitude BETWEEN 40.64952835182244 AND 40.70348764817756 AND claimeds.longitude BETWEEN -73.98305625363352 AND -73.9119075463665)  ORDER BY distance ASC
INSERT INTO "claimeds" ("user_id", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 5], ["latitude", 29.6688634], ["longitude", -95.6322897], ["created_at", "2015-07-09 11:07:53.047997"], ["updated_at", "2015-07-09 11:07:53.047997"]]
SELECT  "claimeds".* FROM "claimeds" WHERE "claimeds"."user_id" = ?  ORDER BY "claimeds"."id" ASC LIMIT 1  [["user_id", 1]]

      address = claim.try(:address)
      items << [address, latitude, longitude]
      neighbors = Claimed.near([latitude,longitude], 3, :units => :km)
      if neighbors.present?
---
SELECT  "claimeds".* FROM "claimeds" WHERE "claimeds"."latitude" = 10.809939 AND "claimeds"."longitude" = 106.73003399999993  ORDER BY "claimeds"."id" ASC LIMIT 1
SELECT  1 AS one FROM "claimeds" WHERE "claimeds"."latitude" = 10.809939 AND "claimeds"."longitude" = 106.73003399999993 LIMIT 1

  def destroy
    @claimed.destroy
---
DELETE FROM "claimeds" WHERE "claimeds"."id" = ?  [["id", 1]]

    def set_claimed
      @claimed = Claimed.find(params[:id])
---
SELECT  "claimeds".* FROM "claimeds" WHERE "claimeds"."id" = ? LIMIT 1  [["id", 2]]